List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame({'Name': ['Alice','sudha','Madhu','Swathi','Ramesh','suresh','hello'],
                    'age': [10,20,30,40,50,60,70],
                    'marks': [90,20,30,40,50,60,40]
                    })

In [3]:
data

     Name  age  marks
0   Alice   10     90
1   sudha   20     20
2   Madhu   30     30
3  Swathi   40     40
4  Ramesh   50     50
5  suresh   60     60
6   hello   70     40

In [4]:
data.describe()

             age      marks
count   7.000000   7.000000
mean   40.000000  47.142857
std    21.602469  22.886885
min    10.000000  20.000000
25%    25.000000  35.000000
50%    40.000000  40.000000
75%    55.000000  55.000000
max    70.000000  90.000000

In [5]:
data.shape

(7, 3)

In [6]:
data.head()

     Name  age  marks
0   Alice   10     90
1   sudha   20     20
2   Madhu   30     30
3  Swathi   40     40
4  Ramesh   50     50

In [7]:
data.tail()

     Name  age  marks
2   Madhu   30     30
3  Swathi   40     40
4  Ramesh   50     50
5  suresh   60     60
6   hello   70     40

In [8]:
data.size

21

In [9]:
data['marks'].sum()

330

In [10]:
data['marks'].mean()

47.142857142857146

In [11]:
data['Name']

0     Alice
1     sudha
2     Madhu
3    Swathi
4    Ramesh
5    suresh
6     hello
Name: Name, dtype: object

Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [12]:
df = pd.DataFrame({"A" : [10,203,40,506],
                   "B" : [10,20,40,60],
                   "C" : [10,20,40,560]}
                 )

In [13]:
df

     A   B    C
0   10  10   10
1  203  20   20
2   40  40   40
3  506  60  560

In [14]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [15]:
df = pd.DataFrame({"A" : [10,203,40,506],
                   "B" : [10,20,40,60],
                   "C" : [10,20,40,560]}
                 , columns = ['B','C','A'] )

In [16]:
df

    B    C    A
0  10   10   10
1  20   20  203
2  40   40   40
3  60  560  506

In [17]:
df.reindex([3,2,0,1])

    B    C    A
3  60  560  506
2  40   40   40
0  10   10   10
1  20   20  203

You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [18]:
da = pd.DataFrame({'Values' : [10,20,30,40,50,60]})

In [19]:
da

   Values
0      10
1      20
2      30
3      40
4      50
5      60

In [20]:
da['Values'].sum()

210

How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() is used to count total values in the dataset and 
DataFrame.shape() it gives you no of rows and columns

In [21]:
df

    B    C    A
0  10   10   10
1  20   20  203
2  40   40   40
3  60  560  506

In [22]:
df.size

12

In [23]:
df.shape

(4, 3)

 Which function of pandas do we use to read an excel file?
 The function which is used to read the file is pd.read_excel('file_name')

You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [25]:
email = {"Name": ['Madhu','Sekhar','Sudha','Mallika'],
         "Email" : ["madhu@gmail.com","sekhar@gmail.com","sudha@gmail.com","mallika@gmail.com"]
        }

In [26]:
dataframe = pd.DataFrame(email)

In [27]:
dataframe

      Name              Email
0    Madhu    madhu@gmail.com
1   Sekhar   sekhar@gmail.com
2    Sudha    sudha@gmail.com
3  Mallika  mallika@gmail.com

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [33]:
num = [10,3,4,5,2,4]
num1 = [10,1,3,5,9,7]
num2 = [32,34,1,23,4,5]

In [38]:
Dataframe = pd.DataFrame([num,num1,num2],columns = ['A','B','C','D','E','F'])

In [46]:
Dataframe

    A   B  C   D  E  F
0  10   3  4   5  2  4
1  10   1  3   5  9  7
2  32  34  1  23  4  5

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [48]:
values = pd.DataFrame([10,20,30,40,50],columns = ['Values'])

In [49]:
values

   Values
0      10
1      20
2      30
3      40
4      50

In [53]:
values.mean()

Values    30.0
dtype: float64

In [54]:
values.std()

Values    15.811388
dtype: float64

In [55]:
values.var()

Values    250.0
dtype: float64

Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

We should import the pandas library